# Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввёл число 3.
# Считаем 3 + 33 + 333 = 369.

# n = input('Введите число n: ')
# print(n)

n = input('Введите число n: ')
b = (n)
c = (n + n)
d = (n + n + n)
g = int(b) + int(c) + int(d)
print(g)

